app/controllers/activations_controller.rb

SELECT * FROM "users" WHERE (perishable_token = 'IC99Y4pfw2dYFu8Qg6w' and updated_at > '2010-09-07 14:28:55') LIMIT 1
---
    def new
      @user = User.find_using_perishable_token(params[:activation_code], 1.week) || (raise Exception)

SELECT * FROM "users" WHERE ("users"."id" = 2)
---
    def create
      @user = User.find(params[:id])