app/controllers/categories_controller.rb

INSERT INTO "categories" ("name", "created_at", "updated_at") VALUES(NULL, '2011-02-19 16:10:10', '2011-02-19 16:10:10')
---
  def create
    @category = Category.new(params[:name])
    if @category.save