app/controllers/comments_controller.rb

  def create
      @post = Post.find(params[:post_id])
      @comment = @post.comments.new(params[:comment])

    if @comment.save
---
SELECT * FROM "posts" WHERE ("posts"."id" = 2)
INSERT INTO "comments" ("comment", "created_at", "author", "updated_at", "post_id") VALUES('Lorem Ipsum is simply dummy text of the printing and typesetting industry', '2010-09-14 14:50:00', 'Pablo Moreira Mora', '2010-09-14 14:50:00', 2)