app/controllers/posts_controller.rb

 def comment
      @comment = Comment.new(
      :post_id => session[:post_id],
      :created_at => Time.now,
      :comment  => params[:comment][:comment]
    )

    if @comment.save
---
INSERT INTO "comments" ("comment", "created_at", "updated_at", "post_id") VALUES('Lorem Ipsum is simply dummy text of the printing and typesetting industry. Lorem Ipsum has been the industrys standard dummy text ever since the 1500s, when an unknown printer took a galley of type and scrambled it to make a type specimen book.', '2010-09-13 12:18:29', '2010-09-13 15:18:29', NULL)