app/controllers/posts_controller.rb

SELECT * FROM "posts" WHERE ("posts"."category_id" IS NULL) LIMIT 1
SELECT * FROM "posts" WHERE (created_at > '2010-09-13 15:12:55') ORDER BY created_at DESC
---
  def index
    if params[:category_id]
      @posts = Post.find_all_by_category_id params[:category_id]
    else
      @posts = Post.find(:all, :order => 'title')

INSERT INTO "posts" ("created_at", "title", "body", "author", "updated_at") VALUES('2010-09-13 14:35:02', 'Lorem Ipsum', 'Lorem Ipsum is simply dummy text of the printing and typesetting industry. Lorem Ipsum has been the industrys standard dummy text ever since the 1500s, when an unknown printer took a galley of type and scrambled it to make a type specimen book. It has survived not only five centuries, but also the leap into electronic typesetting, remaining essentially unchanged. It was popularised in the 1960s with the release of Letraset sheets containing Lorem Ipsum passages, and more recently with desktop publishing software like Aldus PageMaker including versions of Lorem Ipsum', 'Lorem Ipsum', '2010-09-13 14:35:02')
---
  def create
     @post = Post.new( :title => params[:post][:title],
                      :body => params[:post][:body],
                      :author => current_user.full_name,
                      :category_id => params[:post][:category_id]
    )

    if @post.save

SELECT * FROM "posts" WHERE (created_at > '2010-09-13 15:13:42') ORDER BY created_at DESC
SELECT * FROM "comments" WHERE ("comments".post_id = 2)
---
  def show
    @post = Post.find(params[:id])
    @comments = @post.comments.collect